In [1]:
import pandas as pd

## Join Series data using pd.concat()

In [2]:
s1 = pd.Series(['1', '2', '3'])
s2 = pd.Series(['4', '5', '6'])

In [3]:
pd.concat([s1,s2])

0    1
1    2
2    3
0    4
1    5
2    6
dtype: object

In [4]:
pd.concat([s1,s2], ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: object

In [5]:
c1 = pd.Series(['Red', 'Orange', 'Yellow'])
c2 = pd.Series(['Green', 'Blue', 'Purple'])

In [7]:
pd.concat([c1, c2])

0       Red
1    Orange
2    Yellow
0     Green
1      Blue
2    Purple
dtype: object

In [8]:
pd.concat([c1, c2], axis = 1, keys = ['Color1', 'Color2'])

        0       1
0     Red   Green
1  Orange    Blue
2  Yellow  Purple

In [9]:
pd.concat([c1, c2], axis = 0, keys = ['Color1', 'Color2'])

Color1  0       Red
        1    Orange
        2    Yellow
Color2  0     Green
        1      Blue
        2    Purple
dtype: object

In [13]:
pd.concat([c1, c2], axis = 1, keys = ['Color1', 'Color2'], join = 'outer') # Can use join paramerter 'inner' & 'outer'

   Color1  Color2
0     Red   Green
1  Orange    Blue
2  Yellow  Purple

## Joining DataFrames using merge()

In [22]:
midterms = pd.DataFrame([['alex', 'padilla', 92], ['rayan', 'wilson', 83], ['juan', 'gomez', 78], ['angela', 'smith', 66], ['stephen', 'yu', 98]],
                       columns=['first','last','score'])

finals = pd.DataFrame([['alex', 'padilla', 97, False], ['rayan', 'wilson', 88, False], ['alex', 'smith', 86, True], ['juan', 'gomez', 78, True], ['stephen', 'yu', 91, False], ['sakura', 'steel', 100, True]],
                     columns=['first', 'last', 'score', 'extra_credit'])

In [23]:
midterms

     first     last  score
0     alex  padilla     92
1    rayan   wilson     83
2     juan    gomez     78
3   angela    smith     66
4  stephen       yu     98

In [24]:
finals

     first     last  score  extra_credit
0     alex  padilla     97         False
1    rayan   wilson     88         False
2     alex    smith     86          True
3     juan    gomez     78          True
4  stephen       yu     91         False
5   sakura    steel    100          True

In [25]:
midterms.merge(finals, on='score')

  first_x last_x  score first_y last_y  extra_credit
0    juan  gomez     78    juan  gomez          True

In [30]:
midterms.merge(finals, on='first', suffixes=['_midters', '_finals'])

     first last_midters  score_midters last_finals  score_finals  extra_credit
0     alex      padilla             92     padilla            97         False
1     alex      padilla             92       smith            86          True
2    rayan       wilson             83      wilson            88         False
3     juan        gomez             78       gomez            78          True
4  stephen           yu             98          yu            91         False

In [27]:
midterms.merge(finals, on=['first', 'last'])

     first     last  score_x  score_y  extra_credit
0     alex  padilla       92       97         False
1    rayan   wilson       83       88         False
2     juan    gomez       78       78          True
3  stephen       yu       98       91         False

In [28]:
midterms.merge(finals, on=['first', 'last'], how='left')

     first     last  score_x  score_y extra_credit
0     alex  padilla       92     97.0        False
1    rayan   wilson       83     88.0        False
2     juan    gomez       78     78.0         True
3   angela    smith       66      NaN          NaN
4  stephen       yu       98     91.0        False

In [29]:
midterms.merge(finals, on=['first', 'last'], how='outer')

     first     last  score_x  score_y extra_credit
0     alex  padilla     92.0     97.0        False
1    rayan   wilson     83.0     88.0        False
2     juan    gomez     78.0     78.0         True
3   angela    smith     66.0      NaN          NaN
4  stephen       yu     98.0     91.0        False
5     alex    smith      NaN     86.0         True
6   sakura    steel      NaN    100.0         True

In [32]:
combi = midterms.merge(finals, on=['first', 'last'], how='inner', suffixes = ['_m', '_f'])

In [33]:
combi

     first     last  score_m  score_f  extra_credit
0     alex  padilla       92       97         False
1    rayan   wilson       83       88         False
2     juan    gomez       78       78          True
3  stephen       yu       98       91         False

In [34]:
combi['avg'] = (combi['score_m'] + combi['score_f']) / 2

In [35]:
combi

     first     last  score_m  score_f  extra_credit   avg
0     alex  padilla       92       97         False  94.5
1    rayan   wilson       83       88         False  85.5
2     juan    gomez       78       78          True  78.0
3  stephen       yu       98       91         False  94.5